{
  "No blog post is currently open. Please create a new post first.": "No hay ninguna entrada de blog abierta. Por favor, crea una nueva entrada primero.",
  "No blog post is currently open.": "No hay ninguna entrada de blog abierta.",
  "Failed to retrieve post data.": "Error al obtener los datos de la entrada.",
  "No blog configurations found. Please add a blog configuration first.": "No se encontraron configuraciones de blog. Por favor, añade una configuración de blog primero.",
  "Unsupported platform: {0}": "Plataforma no compatible: {0}",
  "Failed to publish post: {0}": "Error al publicar la entrada: {0}",
  "No WordPress blogs configured. Please add a WordPress blog configuration first.": "No hay blogs de WordPress configurados. Por favor, añade una configuración de blog de WordPress primero.",
  "Failed to authenticate: {0}": "Error de autenticación: {0}",
  "WordPress configuration is incomplete. Please configure your WordPress URL and username in settings.": "La configuración de WordPress está incompleta. Por favor, configura la URL y el nombre de usuario de WordPress en los ajustes.",
  "WordPress password not set. Please run \"Live Blog Writer: Set WordPress Password\" command first.": "Contraseña de WordPress no configurada. Por favor, ejecuta primero el comando \"Live Blog Writer: Set WordPress Password\".",
  "WordPress configuration is incomplete. Please update the blog configuration.": "La configuración de WordPress está incompleta. Por favor, actualiza la configuración del blog.",
  "WordPress password not set. Please set it using the blog configuration manager or \"Set WordPress Password\" command.": "Contraseña de WordPress no configurada. Por favor, configúrala usando el gestor de configuración de blogs o el comando \"Set WordPress Password\".",
  "Blogger Blog ID is not configured. Please configure it in settings.": "El ID del blog de Blogger no está configurado. Por favor, configúralo en los ajustes.",
  "Blogger Blog ID is not configured. Please update the blog configuration.": "El ID del blog de Blogger no está configurado. Por favor, actualiza la configuración del blog.",
  "Failed to authenticate with Google: {0}. Please run the \"Live Blog Writer: Authenticate with Blogger\" command to sign in.": "Error de autenticación con Google: {0}. Por favor, ejecuta el comando \"Live Blog Writer: Authenticate with Blogger\" para iniciar sesión.",
  "Ghost site URL is not configured. Please update the blog configuration.": "La URL del sitio Ghost no está configurada. Por favor, actualiza la configuración del blog.",
  "Ghost API key not set for \"{0}\". Please run \"Set Ghost API Key\" command.": "Clave API de Ghost no configurada para \"{0}\". Por favor, ejecuta el comando \"Set Ghost API Key\".",
  "Failed to get current post timestamp. Ghost requires this to prevent conflicts.": "Error al obtener la marca de tiempo de la entrada actual. Ghost requiere esto para prevenir conflictos.",
  "Substack hostname is not configured. Please update the blog configuration.": "El nombre de host de Substack no está configurado. Por favor, actualiza la configuración del blog.",
  "Invalid Substack hostname. Please update the blog configuration.": "Nombre de host de Substack no válido. Por favor, actualiza la configuración del blog.",
  "Substack credentials not set for \"{0}\". Please run \"Set Substack API Key\" command.": "Credenciales de Substack no configuradas para \"{0}\". Por favor, ejecuta el comando \"Set Substack API Key\".",
  "Dev.to API key not set for \"{0}\". Please use Blog Connections to set it, or run \"Live Blog Writer: Set Dev.to API Key\".": "Clave API de Dev.to no configurada para \"{0}\". Por favor, usa Blog Connections para configurarla, o ejecuta \"Live Blog Writer: Set Dev.to API Key\".",
  "No Ghost blog configurations found. Please add a Ghost blog first.": "No se encontraron configuraciones de blog Ghost. Por favor, añade un blog Ghost primero.",
  "No Substack blog configurations found. Please add a Substack blog first.": "No se encontraron configuraciones de blog Substack. Por favor, añade un blog Substack primero.",
  "No Dev.to blog configurations found. Please add a Dev.to account in Blog Connections first.": "No se encontraron configuraciones de Dev.to. Por favor, añade una cuenta de Dev.to en Blog Connections primero.",
  "Failed to load the selected draft.": "Error al cargar el borrador seleccionado.",
  "Failed to load recent drafts: {0}": "Error al cargar los borradores recientes: {0}",
  "Failed to manage drafts: {0}": "Error al gestionar los borradores: {0}",
  "Failed to save draft: {0}": "Error al guardar el borrador: {0}",
  "Failed to edit published post: {0}": "Error al editar la entrada publicada: {0}",
  "Client ID cannot be empty": "El Client ID no puede estar vacío",
  "Client Secret cannot be empty": "El Client Secret no puede estar vacío",
  "Email address is required": "La dirección de correo electrónico es obligatoria",
  "Please enter a valid email address": "Por favor, introduce una dirección de correo electrónico válida",
  "Template name cannot be empty": "El nombre de la plantilla no puede estar vacío",
  "Failed to save template: {0}": "Error al guardar la plantilla: {0}",
  "Failed to load the selected template.": "Error al cargar la plantilla seleccionada.",
  "Failed to create post from template: {0}": "Error al crear la entrada desde la plantilla: {0}",
  "Failed to create drafts folder in Documents.": "Error al crear la carpeta de borradores en Documentos.",
  "Failed to create templates folder in Documents.": "Error al crear la carpeta de plantillas en Documentos.",
  "Blog not found": "Blog no encontrado",
  "Blogger authentication token not found. Please reconnect your Blogger account.": "Token de autenticación de Blogger no encontrado. Por favor, vuelve a conectar tu cuenta de Blogger.",
  "Blogger blog ID is not configured.": "El ID del blog de Blogger no está configurado.",
  "Dev.to API key not found for blog \"{0}\". Please configure the credentials and try again.": "Clave API de Dev.to no encontrada para el blog \"{0}\". Por favor, configura las credenciales e inténtalo de nuevo.",
  "Extension context not available": "Contexto de la extensión no disponible",
  "Failed to load post: {0}": "Error al cargar la entrada: {0}",
  "Ghost API key is not configured. Please set the Ghost API key before fetching posts.": "La clave API de Ghost no está configurada. Por favor, configura la clave API de Ghost antes de obtener entradas.",
  "Ghost blog ID is not configured. Please update your blog settings and try again.": "El ID del blog de Ghost no está configurado. Por favor, actualiza los ajustes de tu blog e inténtalo de nuevo.",
  "Substack credentials not configured. Please set up authentication and try again.": "Credenciales de Substack no configuradas. Por favor, configura la autenticación e inténtalo de nuevo.",
  "Substack hostname not configured. Please update your blog settings and try again.": "El nombre de host de Substack no está configurado. Por favor, actualiza los ajustes de tu blog e inténtalo de nuevo.",
  "WordPress credentials incomplete. Please configure WordPress and try again.": "Credenciales de WordPress incompletas. Por favor, configura WordPress e inténtalo de nuevo.",

  "WordPress password saved securely for \"{0}\".": "Contraseña de WordPress guardada de forma segura para \"{0}\".",
  "Successfully authenticated with Google for Blogger!": "¡Autenticación con Google para Blogger completada correctamente!",
  "Custom OAuth credentials saved. Please re-authenticate with your credentials.": "Credenciales OAuth personalizadas guardadas. Por favor, vuelve a autenticarte con tus credenciales.",
  "Reverted to default OAuth credentials. Please re-authenticate.": "Se han restaurado las credenciales OAuth predeterminadas. Por favor, vuelve a autenticarte.",
  "No recent drafts found.": "No se encontraron borradores recientes.",
  "No drafts found.": "No se encontraron borradores.",
  "Create New Post": "Crear nueva entrada",
  "Deleted {0} old drafts.": "{0} borradores antiguos eliminados.",
  "Draft saved successfully.": "Borrador guardado correctamente.",
  "Ghost API key saved securely.": "Clave API de Ghost guardada de forma segura.",
  "Dev.to API key saved securely.": "Clave API de Dev.to guardada de forma segura.",
  "Substack email/password credentials saved securely for \"{0}\".": "Credenciales de correo/contraseña de Substack guardadas de forma segura para \"{0}\".",
  "Substack cookie credential saved securely for \"{0}\".": "Credencial de cookie de Substack guardada de forma segura para \"{0}\".",
  "Post published successfully to WordPress! Post ID: {0}": "¡Entrada publicada correctamente en WordPress! ID de entrada: {0}",
  "Post published successfully to {0}! Post ID: {1}": "¡Entrada publicada correctamente en {0}! ID de entrada: {1}",
  "Post {0} successfully to Blogger! Post ID: {1}": "¡Entrada {0} correctamente en Blogger! ID de entrada: {1}",
  "Post {0} successfully to {1}! Post ID: {2}": "¡Entrada {0} correctamente en {1}! ID de entrada: {2}",
  "Post updated successfully on {0}!": "¡Entrada actualizada correctamente en {0}!",
  "Post updated successfully on {0}!\nURL: {1}": "¡Entrada actualizada correctamente en {0}!\nURL: {1}",
  "Post {0} successfully to {1}!\nURL: {2}": "¡Entrada {0} correctamente en {1}!\nURL: {2}",
  "Blog configuration \"{0}\" added successfully!": "¡Configuración de blog \"{0}\" añadida correctamente!",
  "Blog configuration removed.": "Configuración de blog eliminada.",
  "Blog configuration updated successfully!": "¡Configuración de blog actualizada correctamente!",
  "Credential updated successfully.": "Credencial actualizada correctamente.",
  "No blog configurations found.": "No se encontraron configuraciones de blog.",
  "No legacy settings found to migrate.": "No se encontraron ajustes heredados para migrar.",
  "Legacy {0} settings migrated to new blog configuration format!": "¡Ajustes heredados de {0} migrados al nuevo formato de configuración de blog!",
  "Remember to set your Ghost API key using the \"Set Ghost API Key\" command.": "Recuerda configurar tu clave API de Ghost usando el comando \"Set Ghost API Key\".",
  "Remember to set your Substack API key using the \"Set Substack API Key\" command.": "Recuerda configurar tu clave API de Substack usando el comando \"Set Substack API Key\".",
  "Template \"{0}\" saved successfully.": "Plantilla \"{0}\" guardada correctamente.",
  "No templates found. Use \"Save as Template\" to create one.": "No se encontraron plantillas. Usa \"Save as Template\" para crear una.",
  "Loaded: {0}": "Cargado: {0}",

  "Default blog '{0}' not found in configured blogs.": "Blog predeterminado '{0}' no encontrado en los blogs configurados.",
  "You are currently using custom OAuth credentials. What would you like to do?": "Actualmente estás usando credenciales OAuth personalizadas. ¿Qué te gustaría hacer?",
  "This extension comes with built-in OAuth credentials. You only need custom credentials if you want to use your own Google Cloud project.\n\nDo you want to set up custom credentials?": "Esta extensión incluye credenciales OAuth integradas. Solo necesitas credenciales personalizadas si quieres usar tu propio proyecto de Google Cloud.\n\n¿Deseas configurar credenciales personalizadas?",
  "Blogger OAuth credentials are not configured. Blogger blog functionality will not work. Please contact the extension maintainer or configure custom OAuth credentials.": "Las credenciales OAuth de Blogger no están configuradas. La funcionalidad de blog de Blogger no funcionará. Por favor, contacta al mantenedor de la extensión o configura credenciales OAuth personalizadas.",
  "Delete all drafts older than 30 days?": "¿Eliminar todos los borradores con más de 30 días de antigüedad?",
  "Remove blog configuration \"{0}\"?": "¿Eliminar la configuración de blog \"{0}\"?",

  "View Post": "Ver entrada",
  "Delete": "Eliminar",
  "Remove": "Quitar",
  "Yes": "Sí",
  "No": "No",
  "Cancel": "Cancelar",
  "Learn More": "Más información",
  "Update Credentials": "Actualizar credenciales",
  "Revert to Default": "Restaurar valores predeterminados",

  "Select which WordPress blog to set the password for": "Selecciona para qué blog de WordPress establecer la contraseña",
  "WordPress application password": "Contraseña de aplicación de WordPress",
  "Select blog to publish to": "Selecciona el blog donde publicar",
  "Select a draft to open": "Selecciona un borrador para abrir",
  "Select an action or draft to open": "Selecciona una acción o borrador para abrir",
  "$(folder-opened) Open Drafts Folder": "$(folder-opened) Abrir carpeta de borradores",
  "Open the drafts folder in file explorer": "Abrir la carpeta de borradores en el explorador de archivos",
  "$(trash) Cleanup Old Drafts": "$(trash) Limpiar borradores antiguos",
  "Delete drafts older than 30 days": "Eliminar borradores con más de 30 días de antigüedad",
  "Untitled Draft": "Borrador sin título",
  "{0} words": "{0} palabras",
  "Select Ghost blog to set API key for": "Selecciona el blog Ghost para configurar la clave API",
  "API key from Ghost Admin settings": "Clave API de los ajustes de Ghost Admin",
  "Select Substack blog to set credentials for": "Selecciona el blog Substack para configurar las credenciales",
  "Select authentication method": "Selecciona el método de autenticación",
  "Cookie (connect.sid)": "Cookie (connect.sid)",
  "Recommended - Most reliable method": "Recomendado - Método más fiable",
  "Email & Password": "Correo electrónico y contraseña",
  "Alternative - May not work due to Substack API restrictions": "Alternativo - Puede no funcionar debido a restricciones de la API de Substack",
  "Select Dev.to account to set API key for": "Selecciona la cuenta de Dev.to para configurar la clave API",
  "DEV API key from Settings → Account → DEV API Keys": "Clave API de DEV desde Ajustes → Cuenta → DEV API Keys",
  "Select blog to edit": "Selecciona el blog a editar",
  "Select blog to remove": "Selecciona el blog a eliminar",
  "Select blog platform": "Selecciona la plataforma del blog",
  "e.g., My Personal Blog": "ej., Mi blog personal",
  "e.g., Weekly Newsletter": "ej., Boletín semanal",
  "Enter a name for this blog configuration": "Introduce un nombre para esta configuración de blog",
  "Enter a name for this template": "Introduce un nombre para esta plantilla",
  "Enter WordPress site URL": "Introduce la URL del sitio WordPress",
  "Enter WordPress username": "Introduce el nombre de usuario de WordPress",
  "Enter WordPress application password": "Introduce la contraseña de aplicación de WordPress",
  "Enter Blogger Blog ID": "Introduce el ID del blog de Blogger",
  "Enter Ghost site URL": "Introduce la URL del sitio Ghost",
  "Enter Substack hostname": "Introduce el nombre de host de Substack",
  "Enter Substack username (optional)": "Introduce el nombre de usuario de Substack (opcional)",
  "Enter WordPress Application Password for \"{0}\"": "Introduce la contraseña de aplicación de WordPress para \"{0}\"",
  "Enter your Google OAuth Client ID": "Introduce tu Google OAuth Client ID",
  "Enter your Google OAuth Client Secret": "Introduce tu Google OAuth Client Secret",
  "Enter your Ghost Admin API key (format: id:secret)": "Introduce tu clave API de Ghost Admin (formato: id:secret)",
  "Enter your Substack connect.sid cookie value": "Introduce el valor de la cookie connect.sid de Substack",
  "connect.sid cookie from your Substack session": "Cookie connect.sid de tu sesión de Substack",
  "Enter your Substack email address": "Introduce tu dirección de correo electrónico de Substack",
  "Enter your Substack password": "Introduce tu contraseña de Substack",
  "Your Substack password": "Tu contraseña de Substack",
  "Enter your Dev.to API key": "Introduce tu clave API de Dev.to",
  "Enter new name": "Introduce el nuevo nombre",
  "Enter new URL/ID": "Introduce la nueva URL/ID",
  "Enter new username": "Introduce el nuevo nombre de usuario",
  "Enter new {0} password/token": "Introduce la nueva contraseña/token de {0}",
  "Edit {0}": "Editar {0}",
  "Change Name": "Cambiar nombre",
  "Update URL/ID": "Actualizar URL/ID",
  "Update Username": "Actualizar nombre de usuario",
  "Update Password/Token": "Actualizar contraseña/token",
  "saved as draft": "guardado como borrador",
  "published": "publicado",
  "Select a template": "Selecciona una plantilla",
  "Created: {0}": "Creado: {0}"
}
